In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
# 
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [15]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#

In [17]:
df.head()

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697

In [18]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 0.10223501,  0.01173988,  2.25840953,  0.41536423],
       [ 0.77020035,  0.44001703, -0.78226644, -0.14447089],
       [ 0.39608993,  0.71784702, -1.18737116,  1.2911268 ],
       [-1.24020312,  0.37595926,  0.77025704, -0.36551623],
       [ 2.23154035, -0.45848241,  0.22986169, -0.14969708],
       [ 0.02052997,  1.6527481 , -0.61848374, -1.06404589]])

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.380065  0.456638  0.111734 -0.002873
std    1.132444  0.712892  1.270901  0.793544
min   -1.240203 -0.458482 -1.187371 -1.064046
25%    0.040956  0.102795 -0.741321 -0.311561
50%    0.249162  0.407988 -0.194311 -0.147084
75%    0.676673  0.648390  0.635158  0.275405
max    2.231540  1.652748  2.258410  1.291127

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.102235    0.770200    0.396090   -1.240203    2.231540    0.020530
B    0.011740    0.440017    0.717847    0.375959   -0.458482    1.652748
C    2.258410   -0.782266   -1.187371    0.770257    0.229862   -0.618484
D    0.415364   -0.144471    1.291127   -0.365516   -0.149697   -1.064046

In [24]:
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [29]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.415364  2.258410  0.011740  0.102235
2013-01-02 -0.144471 -0.782266  0.440017  0.770200
2013-01-03  1.291127 -1.187371  0.717847  0.396090
2013-01-04 -0.365516  0.770257  0.375959 -1.240203
2013-01-05 -0.149697  0.229862 -0.458482  2.231540
2013-01-06 -1.064046 -0.618484  1.652748  0.020530

In [32]:
df.sort_values(by='B', ascending=True)

                   A         B         C         D
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [34]:
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [33]:
df['A']

2013-01-01    0.102235
2013-01-02    0.770200
2013-01-03    0.396090
2013-01-04   -1.240203
2013-01-05    2.231540
2013-01-06    0.020530
Freq: D, Name: A, dtype: float64

In [37]:
df[0:3]

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127

In [38]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516

In [39]:
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [40]:
df.loc[dates[0]]

A    0.102235
B    0.011740
C    2.258410
D    0.415364
Name: 2013-01-01 00:00:00, dtype: float64

In [41]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.102235  0.011740
2013-01-02  0.770200  0.440017
2013-01-03  0.396090  0.717847
2013-01-04 -1.240203  0.375959
2013-01-05  2.231540 -0.458482
2013-01-06  0.020530  1.652748

In [42]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.770200  0.440017
2013-01-03  0.396090  0.717847
2013-01-04 -1.240203  0.375959

In [44]:
df.loc['20130102',['A','B']]

A    0.770200
B    0.440017
Name: 2013-01-02 00:00:00, dtype: float64

In [45]:
df.loc[dates[0],'A']

0.1022350121163542

In [46]:
df.at[dates[0],'A']

0.1022350121163542

In [47]:
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [48]:
df.iloc[3]

A   -1.240203
B    0.375959
C    0.770257
D   -0.365516
Name: 2013-01-04 00:00:00, dtype: float64

In [52]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.240203  0.375959
2013-01-05  2.231540 -0.458482

In [53]:
df.iloc[[1,2,4],[0,2]]

                  A         C
2013-01-02  0.77020 -0.782266
2013-01-03  0.39609 -1.187371
2013-01-05  2.23154  0.229862

In [54]:
df.iloc[1:3,:]

                  A         B         C         D
2013-01-02  0.77020  0.440017 -0.782266 -0.144471
2013-01-03  0.39609  0.717847 -1.187371  1.291127

In [55]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.011740  2.258410
2013-01-02  0.440017 -0.782266
2013-01-03  0.717847 -1.187371
2013-01-04  0.375959  0.770257
2013-01-05 -0.458482  0.229862
2013-01-06  1.652748 -0.618484

In [56]:
df.iloc[1,1]

0.44001703120792984

In [57]:
df.iat[1,1]

0.44001703120792984

In [58]:
df

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-04 -1.240203  0.375959  0.770257 -0.365516
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [59]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017 -0.782266 -0.144471
2013-01-03  0.396090  0.717847 -1.187371  1.291127
2013-01-05  2.231540 -0.458482  0.229862 -0.149697
2013-01-06  0.020530  1.652748 -0.618484 -1.064046

In [60]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.102235  0.011740  2.258410  0.415364
2013-01-02  0.770200  0.440017       NaN       NaN
2013-01-03  0.396090  0.717847       NaN  1.291127
2013-01-04       NaN  0.375959  0.770257       NaN
2013-01-05  2.231540       NaN  0.229862       NaN
2013-01-06  0.020530  1.652748       NaN       NaN

In [62]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.102235  0.011740  2.258410  0.415364    one
2013-01-02  0.770200  0.440017 -0.782266 -0.144471    one
2013-01-03  0.396090  0.717847 -1.187371  1.291127    two
2013-01-04 -1.240203  0.375959  0.770257 -0.365516  three
2013-01-05  2.231540 -0.458482  0.229862 -0.149697   four
2013-01-06  0.020530  1.652748 -0.618484 -1.064046  three

In [63]:
df2[df2['E'].isin(['two','four'])]

                  A         B         C         D     E
2013-01-03  0.39609  0.717847 -1.187371  1.291127   two
2013-01-05  2.23154 -0.458482  0.229862 -0.149697  four

In [65]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    1
2    4
3    0
4    4
5    6
6    2
7    2
8    0
9    4
dtype: int64

In [66]:
s.value_counts()

4    3
2    2
0    2
6    1
5    1
1    1
dtype: int64

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [69]:
df3 = pd.DataFrame(np.random.randn(10, 4))
df3

          0         1         2         3
0  0.042067  0.154799 -0.518155  0.633530
1  0.253151  1.030808 -0.351252  0.752913
2  0.070380  1.101620  0.530748  0.367951
3  0.335357  1.545085  0.701850 -0.266075
4 -1.175617 -1.092388 -0.478164 -1.580720
5 -0.626547  2.931716 -1.083423 -2.376865
6  1.345008 -0.378234 -1.514907  0.403423
7 -0.630237 -0.306060 -1.005534  1.200683
8 -0.469789 -1.001729 -0.791360 -1.259634
9  0.970114  0.558352 -0.819051 -0.258779

In [72]:
pieces = [df3[:3], df3[3:7], df3[7:]]
pieces

[          0         1         2         3
 0  0.042067  0.154799 -0.518155  0.633530
 1  0.253151  1.030808 -0.351252  0.752913
 2  0.070380  1.101620  0.530748  0.367951,
           0         1         2         3
 3  0.335357  1.545085  0.701850 -0.266075
 4 -1.175617 -1.092388 -0.478164 -1.580720
 5 -0.626547  2.931716 -1.083423 -2.376865
 6  1.345008 -0.378234 -1.514907  0.403423,
           0         1         2         3
 7 -0.630237 -0.306060 -1.005534  1.200683
 8 -0.469789 -1.001729 -0.791360 -1.259634
 9  0.970114  0.558352 -0.819051 -0.258779]

In [73]:
pd.concat(pieces)

          0         1         2         3
0  0.042067  0.154799 -0.518155  0.633530
1  0.253151  1.030808 -0.351252  0.752913
2  0.070380  1.101620  0.530748  0.367951
3  0.335357  1.545085  0.701850 -0.266075
4 -1.175617 -1.092388 -0.478164 -1.580720
5 -0.626547  2.931716 -1.083423 -2.376865
6  1.345008 -0.378234 -1.514907  0.403423
7 -0.630237 -0.306060 -1.005534  1.200683
8 -0.469789 -1.001729 -0.791360 -1.259634
9  0.970114  0.558352 -0.819051 -0.258779

In [75]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.655940 -2.531360
1  bar    one -1.167926  1.284996
2  foo    two -1.110285 -1.403139
3  bar  three -1.719482 -0.869455
4  foo    two -0.041668 -1.304663
5  bar    two  0.048277 -0.525557
6  foo    one  0.635431  0.564484
7  foo  three -0.328034 -0.317307

In [76]:
df.groupby('A').sum()

            C         D
A
bar -2.839130 -0.110016
foo -0.188617 -4.991985

In [77]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.167926  1.284996
    three -1.719482 -0.869455
    two    0.048277 -0.525557
foo one    1.291371 -1.966876
    three -0.328034 -0.317307
    two   -1.151953 -2.707802